In [3]:
import pandas as pd
import numpy as np

In [23]:
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['Aammar', 'Amaar', 'Hamza', 'Hazma'],
    'sales_2020': [100, 200, None, 200],
    'sales_2021': [None, 150, 300, 150]
}

In [24]:
df = pd.DataFrame(data)
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Aammar       100.0         NaN
1  01-12-2022         U.S.A.   Amaar       200.0       150.0
2  2022/12/01        America   Hamza         NaN       300.0
3  12-01-2021  United States   Hazma       200.0       150.0

In [25]:
# Date Format
df["date"]  = pd.to_datetime(df["date"], errors="coerce")

The errors="coerce" parameter in the pd.to_datetime() function is used to handle invalid parsing. When converting a column to datetime, there can be values that are not in a recognizable date format. Using errors="coerce" ensures that any such invalid parsing will result in NaT (Not a Time) instead of raising an error.

In [18]:
df["date"] = df['date'].dt.strftime('%y-%m-%d')
df.head()

       date        country    name  sales_2020  sales_2021
0  21-12-01            USA  Aammar       100.0         NaN
1       NaN         U.S.A.   Amaar       200.0       150.0
2       NaN        America   Hamza         NaN       300.0
3       NaN  United States   Hazma       200.0       150.0

In [28]:
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['Aammar', 'Amaar', 'Hamza', 'Hazma'],
    'sales_2020': [100, 200, None, 200],
    'sales_2021': [None, 150, 300, 150]
}

In [29]:
df = pd.DataFrame(data)
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Aammar       100.0         NaN
1  01-12-2022         U.S.A.   Amaar       200.0       150.0
2  2022/12/01        America   Hamza         NaN       300.0
3  12-01-2021  United States   Hazma       200.0       150.0

In [30]:
## Function to standardize date formats
def standardize_date_format(date_str):
    try:
        return pd.to_datetime(date_str, format="%Y-%m-%d", errors='coerce')
    except ValueError:
        try:
            return pd.to_datetime(date_str, format="%d-%m-%Y", errors='coerce')
        except ValueError:
            try:
                return pd.to_datetime(date_str, format="%Y/%m/%d", errors='coerce')
            except ValueError:
                return pd.NaT

# Apply the function to the date column
df["date"] = df["date"].apply(standardize_date_format)

In [31]:
df['date']

0   2021-12-01
1          NaT
2          NaT
3          NaT
Name: date, dtype: datetime64[ns]

In [32]:
# Sample data
data = {
    "date": ["2021-12-01", "01-12-2022", "2022/12/01", "12-01-2021"],
    "country": ["USA", "U.S.A.", "America", "United States"],
    "name": ["Aammar", "Amaar", "Hamza", "Hazma"],
    "sales_2020": [100.0, 200.0, None, 200.0],
    "sales_2021": [None, 150.0, 300.0, 150.0]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

# Function to standardize date formats
def standardize_date_format(date_str):
    for fmt in ("%Y-%m-%d", "%d-%m-%Y", "%Y/%m/%d", "%m-%d-%Y"):
        try:
            return pd.to_datetime(date_str, format=fmt)
        except ValueError:
            continue
    return pd.NaT

# Apply the function to the date column
df["date"] = df["date"].apply(standardize_date_format)

Original DataFrame:
         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Aammar       100.0         NaN
1  01-12-2022         U.S.A.   Amaar       200.0       150.0
2  2022/12/01        America   Hamza         NaN       300.0
3  12-01-2021  United States   Hazma       200.0       150.0

In [33]:
df["date"]

0   2021-12-01
1   2022-12-01
2   2022-12-01
3   2021-01-12
Name: date, dtype: datetime64[ns]

In [37]:
# Harmonize the name of the coutry
country_mapping = {"USA": "USA", "U.S.A.":"USA", "America":"USA", "United States":"USA"}

In [38]:
df['country'] = df['country'].replace(country_mapping)

In [39]:
df["country"]

0    USA
1    USA
2    USA
3    USA
Name: country, dtype: object

In [40]:
# Correct the typographical Mistakes in name
# Let's assume we want to correct 'Jonh Doe' to 'John Doe'

df['name']

0    Aammar
1     Amaar
2     Hamza
3     Hazma
Name: name, dtype: object

In [46]:
df['name'] = df['name'].replace('ammar','Ammar')

In [47]:
df['name']

0    Ammar
1    Ammar
2    Hamza
3    Hamza
Name: name, dtype: object

In [48]:
# remove duplicates
df = df.drop_duplicates(subset="name")
df.head()

        date country   name  sales_2020  sales_2021
0 2021-12-01     USA  Ammar       100.0         NaN
2 2022-12-01     USA  Hamza         NaN       300.0

In [49]:
# 5. Resolving Contradictory Data
# For demonstration, let's assume sales_2021 should always be higher than sales_2020
# We'll remove rows where this condition is not met

data = {
    "date": ["2021-12-01", "01-12-2022", "2022/12/01", "12-01-2021"],
    "country": ["USA", "U.S.A.", "America", "United States"],
    "name": ["Aammar", "Amaar", "Hamza", "Hazma"],
    "sales_2020": [100.0, 200.0, None, 200.0],
    "sales_2021": [None, 150.0, 300.0, 150.0]
}

df = pd.DataFrame(data)
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Aammar       100.0         NaN
1  01-12-2022         U.S.A.   Amaar       200.0       150.0
2  2022/12/01        America   Hamza         NaN       300.0
3  12-01-2021  United States   Hazma       200.0       150.0

In [52]:
df = df.drop(df[df["sales_2021"]<=df['sales_2020']].index)

In [53]:
df

         date  country    name  sales_2020  sales_2021
0  2021-12-01      USA  Aammar       100.0         NaN
2  2022/12/01  America   Hamza         NaN       300.0